Repository: abhinavm24/typewhisper-mac
Catalog: TypeWhisperPluginSDK/Plugins/MCPClientPlugin/Localizable.xcstrings
Source language: en
Languages: de, ja, zh_hans

source: %@ is not one of the values allowed by the tool schema.
de: %@ gehört nicht zu den vom Tool-Schema erlaubten Werten.
ja: %@ はツールスキーマで許可された値ではありません。
zh_hans: %@ 不是工具架构允许的值。

source: %@ must be a JSON %@.
de: %@ muss ein JSON-Wert vom Typ %@ sein.
ja: %@ は JSON の %@ である必要があります。
zh_hans: %@ 必须是 JSON %@。

source: %@ timed out. The request was not retried.
de: Zeitüberschreitung bei %@. Die Anfrage wurde nicht erneut gesendet.
ja: %@ がタイムアウトしました。リクエストは再試行されませんでした。
zh_hans: %@ 超时。请求未重试。

source: %lld actions completed.
de: %lld Aktionen abgeschlossen.
ja: %lld 件のアクションが完了しました。
zh_hans: 已完成 %lld 个操作。

source: %lld of %lld actions completed; failed items: %@.
de: %lld von %lld Aktionen abgeschlossen; fehlgeschlagene Elemente: %@.
ja: %2$lld 件中 %1$lld 件のアクションが完了しました。失敗した項目: %3$@。
zh_hans: 已完成 %2$lld 个操作中的 %1$lld 个；失败项目：%3$@。

source: Acknowledge automatic execution of this destructive tool before saving.
de: Bestätige vor dem Speichern die automatische Ausführung dieses destruktiven Tools.
ja: 保存する前に、この破壊的ツールの自動実行を確認してください。
zh_hans: 保存前请确认自动执行此破坏性工具。

source: Acknowledge that TypeWhisper may launch this executable with your user permissions.
de: Bestätige, dass TypeWhisper dieses Programm mit deinen Benutzerrechten starten darf.
ja: TypeWhisper がユーザー権限でこの実行ファイルを起動することを確認してください。
zh_hans: 请确认 TypeWhisper 可以使用你的用户权限启动此可执行文件。

source: Action
de: Aktion
ja: アクション
zh_hans: 操作

source: Actions
de: Aktionen
ja: アクション
zh_hans: 操作

source: Active application URL
de: URL der aktiven App
ja: アクティブなアプリの URL
zh_hans: 当前应用 URL

source: Active application bundle identifier
de: Bundle-ID der aktiven App
ja: アクティブなアプリのバンドル ID
zh_hans: 当前应用软件包标识符

source: Active application name
de: Name der aktiven App
ja: アクティブなアプリ名
zh_hans: 当前应用名称

source: Activity
de: Aktivität
ja: アクティビティ
zh_hans: 活动

source: Activity summaries never include transcripts, complete arguments, or secret values.
de: Aktivitätszusammenfassungen enthalten niemals Transkripte, vollständige Argumente oder geheime Werte.
ja: アクティビティの概要に文字起こし、完全な引数、シークレット値は含まれません。
zh_hans: 活动摘要绝不包含转录、完整参数或机密值。

source: Add Action
de: Aktion hinzufügen
ja: アクションを追加
zh_hans: 添加操作

source: Add Argument
de: Argument hinzufügen
ja: 引数を追加
zh_hans: 添加参数

source: Add Environment Value
de: Umgebungswert hinzufügen
ja: 環境変数を追加
zh_hans: 添加环境变量

source: Add MCP Action
de: MCP-Aktion hinzufügen
ja: MCP アクションを追加
zh_hans: 添加 MCP 操作

source: Add MCP Server
de: MCP-Server hinzufügen
ja: MCP サーバーを追加
zh_hans: 添加 MCP 服务器

source: Add MCP action
de: MCP-Aktion hinzufügen
ja: MCP アクションを追加
zh_hans: 添加 MCP 操作

source: Add MCP server
de: MCP-Server hinzufügen
ja: MCP サーバーを追加
zh_hans: 添加 MCP 服务器

source: Add Server
de: Server hinzufügen
ja: サーバーを追加
zh_hans: 添加服务器

source: Add a server before creating an action.
de: Füge einen Server hinzu, bevor du eine Aktion erstellst.
ja: アクションを作成する前にサーバーを追加してください。
zh_hans: 创建操作前请先添加服务器。

source: Add a stdio server to discover its tools.
de: Füge einen stdio-Server hinzu, um seine Tools zu finden.
ja: stdio サーバーを追加してツールを検出します。
zh_hans: 添加 stdio 服务器以发现其工具。

source: Add argument
de: Argument hinzufügen
ja: 引数を追加
zh_hans: 添加参数

source: Add bindings for required arguments: %@.
de: Füge Bindungen für erforderliche Argumente hinzu: %@.
ja: 必須引数のバインディングを追加してください: %@。
zh_hans: 请为必需参数添加绑定：%@。

source: Argument Preview
de: Argumentvorschau
ja: 引数プレビュー
zh_hans: 参数预览

source: Arguments
de: Argumente
ja: 引数
zh_hans: 参数

source: Arguments come from runtime JSON.
de: Die Argumente stammen zur Laufzeit aus JSON.
ja: 引数は実行時の JSON から取得されます。
zh_hans: 参数来自运行时 JSON。

source: Authorization
de: Autorisierung
ja: 承認
zh_hans: 授权

source: Automatic Execution
de: Automatische Ausführung
ja: 自動実行
zh_hans: 自动执行

source: Batch raw JSON arguments must use the current batch item.
de: Unverarbeitete JSON-Argumente im Stapelmodus müssen das aktuelle Stapelelement verwenden.
ja: バッチの生 JSON 引数には現在のバッチ項目を使用する必要があります。
zh_hans: 批处理原始 JSON 参数必须使用当前批处理项目。

source: Batch
de: Stapel
ja: バッチ
zh_hans: 批处理

source: Batch mode expects a JSON array, validates all items before the first call, runs at most 100 items sequentially, and never retries writes automatically.
de: Der Stapelmodus erwartet ein JSON-Array, validiert alle Elemente vor dem ersten Aufruf, führt höchstens 100 Elemente nacheinander aus und wiederholt Schreibvorgänge nie automatisch.
ja: バッチモードは JSON 配列を受け取り、最初の呼び出し前に全項目を検証し、最大 100 項目を順番に実行します。書き込みは自動再試行されません。
zh_hans: 批处理模式需要 JSON 数组，在首次调用前验证所有项目，最多按顺序运行 100 个项目，并且绝不自动重试写入。

source: Batch mode requires the processed workflow text to be a JSON array.
de: Der Stapelmodus erfordert, dass der verarbeitete Workflow-Text ein JSON-Array ist.
ja: バッチモードでは処理済みワークフローテキストが JSON 配列である必要があります。
zh_hans: 批处理模式要求处理后的工作流文本为 JSON 数组。

source: Cancel
de: Abbrechen
ja: キャンセル
zh_hans: 取消

source: Command
de: Befehl
ja: コマンド
zh_hans: 命令

source: Configure local MCP processes. Commands are launched directly, never through a shell.
de: Konfiguriere lokale MCP-Prozesse. Befehle werden direkt und nie über eine Shell gestartet.
ja: ローカル MCP プロセスを設定します。コマンドはシェルを介さず直接起動されます。
zh_hans: 配置本地 MCP 进程。命令会直接启动，绝不通过 shell。

source: Connect & Load Tools
de: Verbinden & Tools laden
ja: 接続してツールを読み込む
zh_hans: 连接并加载工具

source: Connection
de: Verbindung
ja: 接続
zh_hans: 连接

source: Connection and action results appear here.
de: Verbindungs- und Aktionsergebnisse erscheinen hier.
ja: 接続とアクションの結果がここに表示されます。
zh_hans: 连接和操作结果会显示在此处。

source: Could not connect to MCP server ‘%@’: %@. stderr: %@
de: Verbindung zum MCP-Server „%@“ nicht möglich: %@. stderr: %@
ja: MCP サーバー「%@」に接続できませんでした: %@。stderr: %@
zh_hans: 无法连接 MCP 服务器“%@”：%@。stderr：%@

source: Could not launch MCP server ‘%@’: %@
de: MCP-Server „%@“ konnte nicht gestartet werden: %@
ja: MCP サーバー「%@」を起動できませんでした: %@
zh_hans: 无法启动 MCP 服务器“%@”：%@

source: Create an action and select it as a workflow Action Target.
de: Erstelle eine Aktion und wähle sie als Aktionsziel eines Workflows aus.
ja: アクションを作成し、ワークフローのアクションターゲットとして選択します。
zh_hans: 创建操作并将其选为工作流操作目标。

source: Current batch item
de: Aktuelles Stapelelement
ja: 現在のバッチ項目
zh_hans: 当前批处理项目

source: Current batch item can only be used in batch mode.
de: Das aktuelle Stapelelement kann nur im Stapelmodus verwendet werden.
ja: 現在のバッチ項目はバッチモードでのみ使用できます。
zh_hans: 当前批处理项目只能在批处理模式中使用。

source: Detected language
de: Erkannte Sprache
ja: 検出された言語
zh_hans: 检测到的语言

source: Each saved action binds one workflow target to one MCP tool.
de: Jede gespeicherte Aktion verbindet ein Workflow-Ziel mit einem MCP-Tool.
ja: 保存した各アクションは、1 つのワークフローターゲットを 1 つの MCP ツールに結び付けます。
zh_hans: 每个已保存操作将一个工作流目标绑定到一个 MCP 工具。

source: Edit
de: Bearbeiten
ja: 編集
zh_hans: 编辑

source: Edit MCP Action
de: MCP-Aktion bearbeiten
ja: MCP アクションを編集
zh_hans: 编辑 MCP 操作

source: Edit MCP Server
de: MCP-Server bearbeiten
ja: MCP サーバーを編集
zh_hans: 编辑 MCP 服务器

source: Enter a server name.
de: Gib einen Servernamen ein.
ja: サーバー名を入力してください。
zh_hans: 请输入服务器名称。

source: Enter an MCP server command.
de: Gib einen MCP-Serverbefehl ein.
ja: MCP サーバーコマンドを入力してください。
zh_hans: 请输入 MCP 服务器命令。

source: Enter an action name.
de: Gib einen Aktionsnamen ein.
ja: アクション名を入力してください。
zh_hans: 请输入操作名称。

source: Environment
de: Umgebung
ja: 環境
zh_hans: 环境

source: Environment variable names must be unique.
de: Namen von Umgebungsvariablen müssen eindeutig sein.
ja: 環境変数名は一意である必要があります。
zh_hans: 环境变量名称必须唯一。

source: Executable not found: %@
de: Ausführbare Datei nicht gefunden: %@
ja: 実行ファイルが見つかりません: %@
zh_hans: 找不到可执行文件：%@

source: Expected valid JSON.
de: Gültiges JSON erwartet.
ja: 有効な JSON が必要です。
zh_hans: 应为有效的 JSON。

source: File is not executable: %@
de: Datei ist nicht ausführbar: %@
ja: ファイルを実行できません: %@
zh_hans: 文件不可执行：%@

source: I understand that TypeWhisper will launch %@ with my user permissions.
de: Ich verstehe, dass TypeWhisper %@ mit meinen Benutzerrechten startet.
ja: TypeWhisper がユーザー権限で %@ を起動することを理解しました。
zh_hans: 我了解 TypeWhisper 将使用我的用户权限启动 %@。

source: I understand that this tool is marked destructive and may change or delete external data.
de: Ich verstehe, dass dieses Tool als destruktiv markiert ist und externe Daten ändern oder löschen kann.
ja: このツールが破壊的とマークされ、外部データを変更または削除する可能性があることを理解しました。
zh_hans: 我了解此工具被标记为破坏性，可能更改或删除外部数据。

source: JSON Source
de: JSON-Quelle
ja: JSON ソース
zh_hans: JSON 来源

source: JSON property path
de: JSON-Eigenschaftspfad
ja: JSON プロパティパス
zh_hans: JSON 属性路径

source: Literal JSON
de: Festes JSON
ja: リテラル JSON
zh_hans: JSON 字面量

source: Literal JSON value
de: Fester JSON-Wert
ja: リテラル JSON 値
zh_hans: JSON 字面值

source: Literal value
de: Fester Wert
ja: リテラル値
zh_hans: 字面值

source: Loaded %lld MCP tools.
de: %lld MCP-Tools geladen.
ja: %lld 個の MCP ツールを読み込みました。
zh_hans: 已加载 %lld 个 MCP 工具。

source: MCP Configuration Unavailable
de: MCP-Konfiguration nicht verfügbar
ja: MCP 設定を利用できません
zh_hans: MCP 配置不可用

source: Loaded %lld tools
de: %lld Tools geladen
ja: %lld 個のツールを読み込みました
zh_hans: 已加载 %lld 个工具

source: Loading tools…
de: Tools werden geladen …
ja: ツールを読み込み中…
zh_hans: 正在加载工具…

source: MCP Action
de: MCP-Aktion
ja: MCP アクション
zh_hans: MCP 操作

source: MCP Client is not active.
de: MCP Client ist nicht aktiv.
ja: MCP Client が有効ではありません。
zh_hans: MCP Client 未启用。

source: MCP Servers
de: MCP-Server
ja: MCP サーバー
zh_hans: MCP 服务器

source: MCP action completed.
de: MCP-Aktion abgeschlossen.
ja: MCP アクションが完了しました。
zh_hans: MCP 操作已完成。

source: MCP action failed.
de: MCP-Aktion fehlgeschlagen.
ja: MCP アクションに失敗しました。
zh_hans: MCP 操作失败。

source: MCP argument ‘%@’ must be a JSON %@.
de: Das MCP-Argument „%@“ muss ein JSON-Wert vom Typ %@ sein.
ja: MCP 引数「%@」は JSON の %@ である必要があります。
zh_hans: MCP 参数“%@”必须是 JSON %@。

source: MCP connection
de: MCP-Verbindung
ja: MCP 接続
zh_hans: MCP 连接

source: MCP tool call
de: MCP-Tool-Aufruf
ja: MCP ツール呼び出し
zh_hans: MCP 工具调用

source: MCP tool discovery
de: MCP-Tool-Erkennung
ja: MCP ツール検出
zh_hans: MCP 工具发现

source: Missing required MCP argument: %@.
de: Erforderliches MCP-Argument fehlt: %@.
ja: 必須の MCP 引数がありません: %@。
zh_hans: 缺少必需的 MCP 参数：%@。

source: Missing server
de: Server fehlt
ja: サーバーがありません
zh_hans: 服务器缺失

source: Move argument down
de: Argument nach unten verschieben
ja: 引数を下へ移動
zh_hans: 下移参数

source: Move argument up
de: Argument nach oben verschieben
ja: 引数を上へ移動
zh_hans: 上移参数

source: Mode
de: Modus
ja: モード
zh_hans: 模式

source: No Activity
de: Keine Aktivität
ja: アクティビティなし
zh_hans: 无活动

source: No MCP Actions
de: Keine MCP-Aktionen
ja: MCP アクションなし
zh_hans: 无 MCP 操作

source: No MCP Servers
de: Keine MCP-Server
ja: MCP サーバーなし
zh_hans: 无 MCP 服务器

source: Original transcript
de: Originaltranskript
ja: 元の文字起こし
zh_hans: 原始转录

source: Processed workflow JSON
de: Verarbeitetes Workflow-JSON
ja: 処理済みワークフロー JSON
zh_hans: 已处理的工作流 JSON

source: Processed workflow text
de: Verarbeiteter Workflow-Text
ja: 処理済みワークフローテキスト
zh_hans: 已处理的工作流文本

source: Property path
de: Eigenschaftspfad
ja: プロパティパス
zh_hans: 属性路径

source: Raw JSON Arguments
de: Unverarbeitete JSON-Argumente
ja: 生の JSON 引数
zh_hans: 原始 JSON 参数

source: Raw JSON arguments must resolve to an object.
de: Unverarbeitete JSON-Argumente müssen ein Objekt ergeben.
ja: 生の JSON 引数はオブジェクトである必要があります。
zh_hans: 原始 JSON 参数必须解析为对象。

source: Recent Activity
de: Letzte Aktivität
ja: 最近のアクティビティ
zh_hans: 最近活动

source: Refresh Tools
de: Tools aktualisieren
ja: ツールを更新
zh_hans: 刷新工具

source: Refresh incompatible argument bindings before saving.
de: Aktualisiere inkompatible Argumentbindungen vor dem Speichern.
ja: 保存する前に互換性のない引数バインディングを更新してください。
zh_hans: 保存前请刷新不兼容的参数绑定。

source: Remove MCP action
de: MCP-Aktion entfernen
ja: MCP アクションを削除
zh_hans: 移除 MCP 操作

source: Remove MCP server
de: MCP-Server entfernen
ja: MCP サーバーを削除
zh_hans: 移除 MCP 服务器

source: Remove argument
de: Argument entfernen
ja: 引数を削除
zh_hans: 移除参数

source: Remove environment value
de: Umgebungswert entfernen
ja: 環境変数を削除
zh_hans: 移除环境变量

source: Required
de: Erforderlich
ja: 必須
zh_hans: 必需

source: Resolved executable
de: Aufgelöste Programmdatei
ja: 解決された実行ファイル
zh_hans: 已解析的可执行文件

source: Sample JSON property
de: Beispielhafte JSON-Eigenschaft
ja: サンプル JSON プロパティ
zh_hans: 示例 JSON 属性

source: Sample batch item
de: Beispielhaftes Stapelelement
ja: サンプルバッチ項目
zh_hans: 示例批处理项目

source: Sample original transcript
de: Beispielhaftes Originaltranskript
ja: サンプルの元の文字起こし
zh_hans: 示例原始转录

source: Sample processed text
de: Beispielhafter verarbeiteter Text
ja: サンプル処理済みテキスト
zh_hans: 示例已处理文本

source: Save
de: Speichern
ja: 保存
zh_hans: 保存

source: Saving and selecting an action authorizes TypeWhisper to run that fixed tool automatically when the workflow completes.
de: Durch Speichern und Auswählen einer Aktion darf TypeWhisper dieses festgelegte Tool nach Abschluss des Workflows automatisch ausführen.
ja: アクションを保存して選択すると、ワークフロー完了時に TypeWhisper がその固定ツールを自動実行することを許可します。
zh_hans: 保存并选择操作即授权 TypeWhisper 在工作流完成时自动运行该固定工具。

source: Secret
de: Geheim
ja: シークレット
zh_hans: 机密

source: Select a tool…
de: Tool auswählen …
ja: ツールを選択…
zh_hans: 选择工具…

source: Select an MCP tool.
de: Wähle ein MCP-Tool aus.
ja: MCP ツールを選択してください。
zh_hans: 请选择 MCP 工具。

source: Servers
de: Server
ja: サーバー
zh_hans: 服务器

source: Single
de: Einzeln
ja: 単一
zh_hans: 单次

source: Source
de: Quelle
ja: ソース
zh_hans: 来源

source: Store environment value in Keychain
de: Umgebungswert im Schlüsselbund speichern
ja: 環境変数をキーチェーンに保存
zh_hans: 将环境变量存储在钥匙串中

source: The MCP client is not connected.
de: Der MCP Client ist nicht verbunden.
ja: MCP Client は接続されていません。
zh_hans: MCP Client 未连接。

source: The MCP connection was lost after the request may have been sent. The request was not retried.
de: Die MCP-Verbindung ging verloren, nachdem die Anfrage möglicherweise gesendet wurde. Die Anfrage wurde nicht erneut gesendet.
ja: リクエスト送信後の可能性がある時点で MCP 接続が失われました。リクエストは再試行されませんでした。
zh_hans: MCP 连接在请求可能已发送后丢失。请求未重试。

source: The MCP tool reported an error.
de: Das MCP-Tool hat einen Fehler gemeldet.
ja: MCP ツールがエラーを報告しました。
zh_hans: MCP 工具报告了错误。

source: The MCP tool ‘%@’ is no longer available. Refresh the action configuration.
de: Das MCP-Tool „%@“ ist nicht mehr verfügbar. Aktualisiere die Aktionskonfiguration.
ja: MCP ツール「%@」は利用できなくなりました。アクション設定を更新してください。
zh_hans: MCP 工具“%@”已不可用。请刷新操作配置。

source: The batch contains %lld items. MCP Client supports at most %lld.
de: Der Stapel enthält %lld Elemente. MCP Client unterstützt höchstens %lld.
ja: バッチには %lld 項目あります。MCP Client がサポートする上限は %lld 項目です。
zh_hans: 批处理包含 %lld 个项目。MCP Client 最多支持 %lld 个。

source: The command is not interpreted by a shell. The process may still access files and services available to your macOS user.
de: Der Befehl wird nicht von einer Shell interpretiert. Der Prozess kann dennoch auf Dateien und Dienste zugreifen, die deinem macOS-Benutzer zur Verfügung stehen.
ja: コマンドはシェルで解釈されません。ただし、プロセスは macOS ユーザーが利用できるファイルやサービスにアクセスできます。
zh_hans: 命令不会由 shell 解释。该进程仍可访问你的 macOS 用户可用的文件和服务。

source: The configured MCP action no longer exists.
de: Die konfigurierte MCP-Aktion existiert nicht mehr.
ja: 設定された MCP アクションは存在しません。
zh_hans: 已配置的 MCP 操作已不存在。

source: The configured MCP server no longer exists.
de: Der konfigurierte MCP-Server existiert nicht mehr.
ja: 設定された MCP サーバーは存在しません。
zh_hans: 已配置的 MCP 服务器已不存在。

source: The input is not valid UTF-8 text.
de: Die Eingabe ist kein gültiger UTF-8-Text.
ja: 入力は有効な UTF-8 テキストではありません。
zh_hans: 输入不是有效的 UTF-8 文本。

source: The input schema for ‘%@’ changed. Refresh the action configuration.
de: Das Eingabeschema für „%@“ hat sich geändert. Aktualisiere die Aktionskonfiguration.
ja: 「%@」の入力スキーマが変更されました。アクション設定を更新してください。
zh_hans: “%@”的输入架构已更改。请刷新操作配置。

source: The stored MCP configuration could not be loaded. It was left unchanged to prevent data loss.
de: Die gespeicherte MCP-Konfiguration konnte nicht geladen werden. Sie wurde unverändert beibehalten, um Datenverlust zu verhindern.
ja: 保存された MCP 設定を読み込めませんでした。データ損失を防ぐため、保存データは変更されていません。
zh_hans: 无法加载已存储的 MCP 配置。为防止数据丢失，原始数据保持不变。

source: This fixed MCP tool runs automatically whenever a workflow using this Action Target completes.
de: Dieses festgelegte MCP-Tool wird automatisch ausgeführt, sobald ein Workflow mit diesem Aktionsziel abgeschlossen ist.
ja: この固定 MCP ツールは、このアクションターゲットを使用するワークフローの完了時に自動実行されます。
zh_hans: 使用此操作目标的工作流完成时，该固定 MCP 工具会自动运行。

source: This tool has no top-level properties to map. Use Raw JSON Arguments for complex schemas.
de: Dieses Tool hat keine zuzuordnenden Eigenschaften auf oberster Ebene. Verwende für komplexe Schemas unverarbeitete JSON-Argumente.
ja: このツールにはマッピング可能なトップレベルプロパティがありません。複雑なスキーマには生の JSON 引数を使用してください。
zh_hans: 此工具没有可映射的顶层属性。复杂架构请使用原始 JSON 参数。

source: Use an absolute path or a bare executable name instead of: %@
de: Verwende einen absoluten Pfad oder nur den Programmnamen anstelle von: %@
ja: %@ の代わりに絶対パスまたは実行ファイル名のみを使用してください
zh_hans: 请使用绝对路径或单独的可执行文件名，而不是：%@

source: Value
de: Wert
ja: 値
zh_hans: 值

source: Workflow Actions
de: Workflow-Aktionen
ja: ワークフローアクション
zh_hans: 工作流操作

source: Acknowledge that TypeWhisper may connect to this MCP server and send configured workflow data.
de: Bestätige, dass TypeWhisper eine Verbindung zu diesem MCP-Server herstellen und konfigurierte Workflow-Daten senden darf.
ja: TypeWhisper がこの MCP サーバーに接続し、設定されたワークフローデータを送信できることを確認してください。
zh_hans: 请确认 TypeWhisper 可以连接此 MCP 服务器并发送已配置的工作流数据。

source: Add a stdio or Streamable HTTP server to discover its tools.
de: Füge einen stdio- oder Streamable-HTTP-Server hinzu, um seine Tools zu finden.
ja: stdio または Streamable HTTP サーバーを追加してツールを検出します。
zh_hans: 添加 stdio 或 Streamable HTTP 服务器以发现其工具。

source: Authentication
de: Authentifizierung
ja: 認証
zh_hans: 身份验证

source: Configure local stdio processes or remote Streamable HTTP endpoints.
de: Konfiguriere lokale stdio-Prozesse oder entfernte Streamable-HTTP-Endpunkte.
ja: ローカルの stdio プロセスまたはリモートの Streamable HTTP エンドポイントを設定します。
zh_hans: 配置本地 stdio 进程或远程 Streamable HTTP 端点。

source: Endpoint URL
de: Endpunkt-URL
ja: エンドポイント URL
zh_hans: 端点 URL

source: Enter a bearer token.
de: Gib einen Bearer-Token ein.
ja: Bearer トークンを入力してください。
zh_hans: 请输入 Bearer 令牌。

source: Enter a valid MCP server URL using HTTPS, or HTTP for a local address.
de: Gib eine gültige MCP-Server-URL mit HTTPS oder HTTP für eine lokale Adresse ein.
ja: HTTPS、またはローカルアドレスには HTTP を使用した有効な MCP サーバー URL を入力してください。
zh_hans: 请输入使用 HTTPS 的有效 MCP 服务器 URL，或为本地地址使用 HTTP。

source: I understand that TypeWhisper will connect to this MCP server and may send configured workflow data.
de: Ich verstehe, dass TypeWhisper eine Verbindung zu diesem MCP-Server herstellt und konfigurierte Workflow-Daten senden kann.
ja: TypeWhisper がこの MCP サーバーに接続し、設定されたワークフローデータを送信する場合があることを理解しています。
zh_hans: 我了解 TypeWhisper 将连接此 MCP 服务器，并可能发送已配置的工作流数据。

source: None
de: Keine
ja: なし
zh_hans: 无

source: The bearer token is stored in the macOS Keychain and sent only in the Authorization header.
de: Der Bearer-Token wird im macOS-Schlüsselbund gespeichert und nur im Authorization-Header gesendet.
ja: Bearer トークンは macOS キーチェーンに保存され、Authorization ヘッダーでのみ送信されます。
zh_hans: Bearer 令牌存储在 macOS 钥匙串中，并且仅通过 Authorization 标头发送。

source: Use only an MCP endpoint you trust. Tool calls can include text and context mapped by your workflow action.
de: Verwende nur einen vertrauenswürdigen MCP-Endpunkt. Tool-Aufrufe können Text und Kontext enthalten, die deine Workflow-Aktion zuordnet.
ja: 信頼できる MCP エンドポイントのみを使用してください。ツール呼び出しには、ワークフローアクションでマッピングされたテキストやコンテキストが含まれる場合があります。
zh_hans: 仅使用你信任的 MCP 端点。工具调用可能包含工作流操作映射的文本和上下文。

source: Add a Streamable HTTP server to discover its tools.
de: Füge einen Streamable-HTTP-Server hinzu, um seine Tools zu finden.
ja: Streamable HTTP サーバーを追加してツールを検出します。
zh_hans: 添加 Streamable HTTP 服务器以发现其工具。

source: Configure remote Streamable HTTP endpoints.
de: Konfiguriere entfernte Streamable-HTTP-Endpunkte.
ja: リモートの Streamable HTTP エンドポイントを設定します。
zh_hans: 配置远程 Streamable HTTP 端点。

source: This edition of TypeWhisper can only connect to Streamable HTTP MCP servers.
de: Diese Version von TypeWhisper kann nur Verbindungen zu Streamable-HTTP-MCP-Servern herstellen.
ja: このエディションの TypeWhisper は Streamable HTTP の MCP サーバーにのみ接続できます。
zh_hans: 此版本的 TypeWhisper 只能连接到 Streamable HTTP MCP 服务器。

source: Argument
ja: 引数
zh_hans: 参数

source: MCP Tool
ja: MCP ツール
zh_hans: MCP 工具

source: Name
ja: 名前
zh_hans: 名称

source: SF Symbol
ja: SF シンボル
zh_hans: SF 符号

source: Server
ja: サーバー
zh_hans: 服务器

source: Tool
ja: ツール
zh_hans: 工具

source: Bearer token
ja: Bearer トークン
zh_hans: Bearer 令牌

source: Transport
ja: トランスポート
zh_hans: 传输方式
